---
kind: enumMember
id: F:Autodesk.Revit.DB.FamilyElementVisibilityType.ViewSpecific
enum: Autodesk.Revit.DB.FamilyElementVisibilityType
source: html/729194e0-afdb-3043-f8da-c808dd257496.htm
---
# Autodesk.Revit.DB.FamilyElementVisibilityType.ViewSpecific

The element will be displayed only in the view where it is created. This
applies to items like detail components, annotations, and view-specific imports.